---
kind: property
id: P:Autodesk.Revit.DB.Visual.SchemaCommon.Hidden
source: html/092e783b-a7b5-0fff-92b9-feecf67dec57.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon.Hidden Property

The property labeled "Hidden" common to all visual Asset types.

## Syntax (C#)
```csharp
public static string Hidden { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".